Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ШаблоныСообщений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуютсяКнопки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_КатегорииШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>180</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЯзыкиЧатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыПодтвержденияШаблонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступенДляВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСодержимого</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыСодержимогоШаблона</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяМетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_СпециальныеМетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодготовки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПослеОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Кнопки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.iga_ТипыКнопокСообщения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрКнопки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ПодразделенияОператоров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПримера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыСодержимогоШаблона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыСодержимогоШаблона</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_КатегорииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_КатегорииШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Маркетинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыКнопокСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыКнопокСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ШаблоныСообщений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаПрикрепленныйФайл.Видимость = Объект.ТипСодержимого = ПредопределенноеЗначение("Перечисление.iga_ТипыСодержимогоШаблона.Изображение");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстСообщенияHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Истина);
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияHTMLДокументСформирован(Элемент)
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПараметров(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Используем регулярное выражение для поиска текста в фигурных скобках
	// Шаблон \{([^}]+)\} означает: найти "{", захватить всё, что не является "}", и найти "}"
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; // Игнорировать регистр
	RegExp.Global     = Истина; // Искать все вхождения
	RegExp.MultiLine  = Истина;
	RegExp.Pattern    = "\{([^}]+)\}";
	
	Попытка
		Matches = RegExp.Execute(ТекстСообщения);
	Исключение
		Сообщить("Ошибка при разборе текста алгоритма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	СтарыеПараметры = Новый Соответствие;
	Для Каждого СтрокаПараметра Из Объект.ПараметрыШаблона Цикл
		СтруктураСтроки = Новый Структура("ЗначениеПримера, ЗначениеИсточник");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаПараметра);
		СтарыеПараметры.Вставить(СтрокаПараметра.ИмяПараметра, СтруктураСтроки);
	КонецЦикла;
	
	Объект.ПараметрыШаблона.Очистить();
	
	СтруктураПоиска = Новый Структура("ИмяПараметра");
	
	СчетчикПараметров = 0;
	Для Каждого Match Из Matches Цикл
	
		ИмяИзТекста = Match.SubMatches(0);
		
		СтруктураПоиска.ИмяПараметра = ИмяИзТекста;
		Если Объект.ПараметрыШаблона.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СчетчикПараметров = СчетчикПараметров + 1;
		
		СтрокаПараметра = Объект.ПараметрыШаблона.Добавить();
		СтрокаПараметра.Номер = СчетчикПараметров;
		СтрокаПараметра.ИмяПараметра = ИмяИзТекста;
		СтарыеЗначения = СтарыеПараметры.Получить(СтрокаПараметра.ИмяПараметра);
		Если Не СтарыеЗначения = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтарыеЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаТекста(ТекстРезуьтат, ДопПараметры) Экспорт 
	
	Если ТекстРезуьтат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекстСообщения = ТекстРезуьтат;
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
	ОбновитьСписокПараметров(Объект.ТекстСообщения);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаТекста", ЭтаФорма);
	
	ОткрытьФорму("Обработка.iga_РедакторТекстаHTML.Форма.Форма", Новый Структура("ТекстДляРедактирования", Объект.ТекстСообщения), ЭтаФорма,
		,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Функция ОтправитьНаПодтверждениеНаСервере()
	
	ЭтоИзображение = Объект.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Изображение;
	
	НовыйШаблон = Объект.Идентификатор = "";
	
	СтруктураШаблона = Новый Структура;
	Если НовыйШаблон Тогда
		СтруктураШаблона.Вставить("elementName", Объект.ИмяШаблона);
		СтруктураШаблона.Вставить("languageCode", ?(Объект.Язык = Справочники.iga_ЯзыкиЧатов.Казахский, "kk", "ru"));
		СтруктураШаблона.Вставить("category", ?(Объект.Категория = Перечисления.iga_КатегорииШаблонов.Маркетинг, "MARKETING", "UTILITY"));
		СтруктураШаблона.Вставить("templateType", ?(ЭтоИзображение, "IMAGE","TEXT"));
		СтруктураШаблона.Вставить("vertical", Объект.КраткоеОписание);
	КонецЕсли;
	
	Если ЭтоИзображение Тогда
		СтруктураШаблона.Вставить("mediaUrl", Объект.СсылкаНаИзображение);
	КонецЕсли;
	
	ОтправляемыйТекст = Объект.ТекстСообщения;
	СчетчикПараметров = 0;
	Пока Истина Цикл
		
		НайденноеЗначение = СтрНайтиПоРегулярномуВыражению(ОтправляемыйТекст, "(?<!\{)\{[^{}]+\}(?!\})");
		Если НайденноеЗначение.НачальнаяПозиция = 0 Тогда
			Прервать;
		КонецЕсли;
		СчетчикПараметров = СчетчикПараметров + 1;
		
		ДлинаПараметра =  НайденноеЗначение.Длина;
		ЛеваяЧасть = Лев(ОтправляемыйТекст, НайденноеЗначение.НачальнаяПозиция - 1);
		
		Центр = "{{" + СчетчикПараметров + "}}";
		
		ПраваяЧасть = Прав(ОтправляемыйТекст, СтрДлина(ОтправляемыйТекст) - (НайденноеЗначение.НачальнаяПозиция + ДлинаПараметра - 1));
		
		ОтправляемыйТекст = ЛеваяЧасть +  Центр + ПраваяЧасть;
	КонецЦикла;
	СтруктураШаблона.Вставить("content", ОтправляемыйТекст);
	Если Не Объект.ЗаголовокСообщения = "" Тогда
		СтруктураШаблона.Вставить("header", Объект.ЗаголовокСообщения);
		СтруктураШаблона.Вставить("exampleHeader", Объект.ЗаголовокСообщения);
	КонецЕсли;
	
	ТекстПримера = Объект.ТекстСообщения;
	Для Каждого СтрокаПараметра Из Объект.ПараметрыШаблона Цикл
		ТекстПримера = СтрЗаменить(ТекстПримера, "{" + СтрокаПараметра.ИмяПараметра + "}", СтрокаПараметра.ЗначениеПримера);
	КонецЦикла;
	СтруктураШаблона.Вставить("example", ТекстПримера);
	Если Объект.Кнопки.Количество() > 0 Тогда
		МассивКнопок = Новый Массив;
		Для Каждого ДанныеКнопки Из Объект.Кнопки Цикл
			СтруктураКнопки = Новый Структура;
			МассивКнопок.Добавить(СтруктураКнопки);
			
			Если ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.Ответ Тогда
				СтруктураКнопки.Вставить("type", "QUICK_REPLY");
			ИначеЕсли ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.ПереходПоСсылке Тогда
				СтруктураКнопки.Вставить("type", "URL");
				СтруктураКнопки.Вставить("url", ДанныеКнопки.Значение);
			ИначеЕсли ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.НомерТелефона Тогда
				СтруктураКнопки.Вставить("type", "PHONE_NUMBER");
				СтруктураКнопки.Вставить("phone_number", ДанныеКнопки.Значение);
			КонецЕсли;
			Найдено = СтрНайтиВсеПоРегулярномуВыражению(ДанныеКнопки.Значение, "\{\{([^}]+)\}\}", Истина, Истина);
			
			Если Найдено.Количество() > 0 Тогда
				СтруктураКнопки.Вставить("example", ДанныеКнопки.ЗначениеПримера);
			КонецЕсли;
			
			СтруктураКнопки.Вставить("text", ДанныеКнопки.Заголовок);
		КонецЦикла;
		
	КонецЕсли;
	СтруктураШаблона.Вставить("buttons", ЗаписатьЗначениеJSON(МассивКнопок)); 
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Если НовыйШаблон Тогда
		ТелоЗапроса = ЗаписатьЗначениеJSON(СтруктураШаблона);
		Результат = Бот.СоздатьШаблонСообщения(СтруктураШаблона);
	Иначе
		СтруктураИзменение = Новый Структура;
		СтруктураИзменение.Вставить("templateId", Объект.Идентификатор);
		СтруктураИзменение.Вставить("templateParams", СтруктураШаблона);
		СтруктураИзменение.Вставить("enableSample", Истина);
		СтруктураИзменение.Вставить("allowTemplateCategoryChange", Истина);
		ТелоЗапроса = ЗаписатьЗначениеJSON(СтруктураИзменение);
		Результат = Бот.ИзменитьШаблонСообщения(СтруктураШаблона);
	КонецЕсли;
		
	Если Результат = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось создать/изменить шаблон.";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Объект.Идентификатор = Результат.template.templateId;
	
	
	Объект.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ПолучитьПеречислениеПоСтатусу(Результат.template.status);
	Если Результат.template.status = "FAILED" И Результат.template.Свойство("reason") Тогда 
		Объект.ОшибкаШаблона = Результат.template.reason;
	КонецЕсли;
	
	Записать();
	
	УстановитьВидимостьОшибки();
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ОтправитьНаПодтверждение(Команда)
	
	Успех = ОтправитьНаПодтверждениеНаСервере();
	Если Успех Тогда
		ПоказатьПредупреждение(, "Шаблон успешно создан/изменен!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьШаблонНаСервере()
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	Результат = Бот.УдалитьШаблонСообщения(Объект.ИмяШаблона);
	
	Если Не ТипЗнч(Результат) = Тип("Структура")
		Или Не Результат.status = "success" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось удалить шаблон.";
		Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Объект.Идентификатор = "";
	Объект.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.Создан;
	Записать();
	
	УстановитьВидимостьОшибки();
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура УдалитьШаблон(Команда)
	
	Если Объект.ИмяШаблона = "" Тогда
		Возврат;
	КонецЕсли;
	
	Успешно = УдалитьШаблонНаСервере();
	
	Если Успешно Тогда
		ПоказатьПредупреждение(, "Шаблон успешно удален");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОшибки()

	Если Объект.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ОшибкаШаблона Тогда
		Элементы.ОшибкаШаблона.Видимость = Истина;
	Иначе
		ЭЛементы.ОшибкаШаблона.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьОшибки();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПараметрыШаблонаЗначениеПримераНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ПараметрыШаблона.ТекущиеДанные;
	
	Значение = Ждать ВвестиСтрокуАсинх(ТекущаяСтрока.ЗначениеПримера, "Введите значение", 100, Истина);
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.ЗначениеПримера = Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСПримером(Команда)
	
	ТекстРедактора = Объект.ТекстСообщения;
	
	Для Каждого СтрокаПараметров Из Объект.ПараметрыШаблона Цикл
		ТекстРедактора = СтрЗаменить(ТекстРедактора, "{" + СтрокаПараметров.ИмяПараметра + "}", 
			СтрокаПараметров.ЗначениеПримера);
	КонецЦикла;
	
	ПараметрыОткрытия = Новый Структура("ТекстДляРедактирования, Просмотр", ТекстРедактора, Истина);
	
	ОткрытьФорму("Обработка.iga_РедакторТекстаHTML.Форма.Форма", ПараметрыОткрытия, ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяШаблонаПриИзменении(Элемент)
	
	Объект.ИмяШаблона = iga_ОбщегоНазначенияКлиентСервер.ИдеальноеИмяФайла(Объект.ИмяШаблона,, "Template");	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСодержимогоПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАлгоритм(Команда)
	
	Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура() - Произвольные параметры обработчика
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаАлгоритмПодготовки Тогда
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "АлгоритмПодготовки", Подсказка, "ПроверочныйКод");
	Иначе
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "АлгоритмПослеОтправки", Подсказка, "ПроверочныйКодПослеОтправки");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрКартинки(Команда)
	
	ОткрытьФорму("ОбщаяФорма.iga_ПросмотрИзображения", Новый Структура("СсылкаНаИзображение", Объект.СсылкаНаИзображение), ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкаНаФайл(ВыбФайл)
	
	Возврат ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбФайл, "СсылкаНаФайл");
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеВыбораФайлаПрикрепления(ВыбФайл, ДопПараметры) Экспорт
	
	Если ВыбФайл = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.СсылкаНаИзображение = ПолучитьСсылкаНаФайл(ВыбФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораФайлаПрикрепления", ЭтаФорма);
	
	ОткрытьФорму("Справочник.iga_ДополнительныеФайлы.ФормаВыбора", Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина),
		ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
